{
  "base_model_name_or_path": "../model/chinese-llama-alpaca-plus-lora-7b",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": ".*(1[6_9]|2[0-9]|3[0-1]).*(q_proj|k_proj|down_proj|up_proj|gate_proj)",
  "task_type": "CAUSAL_LM"
}